Ludovic-Lesur/lpc55xx-drivers/src/usb_hs_device.c
/*
 * usb_hs_device.c
 *
 *  Created on: 15 mar. 2023
 *      Author: Ludo
 */

#ifndef LPC55XX_DRIVERS_DISABLE_FLAGS_FILE
#include "lpc55xx_drivers_flags.h"
#endif

#ifndef LPC55XX_DRIVERS_DISABLE

#include "usb_hs_device.h"

#include "error.h"
#include "maths.h"
#include "nvic.h"
#include "syscon.h"
#include "systick.h"
#include "usb_hs_device_registers.h"
#include "usb_hs_host_registers.h"

/*** USB HS DEVICE local macros ***/

#define USB_HS_DEVICE_ADDRESS_MAX                               0x7F
#define USB_HS_DEVICE_ADDRESS_MASK                              USB_HS_DEVICE_ADDRESS_MAX

#define USB_HS_DEVICE_SETUP_PACKET_SIZE_BYTES                   8

#define USB_HS_DEVICE_DISCONNECT_DELAY_US                       10000

#define USB_HS_DEVICE_NUMBER_OF_LOGICAL_ENDPOINTS               6
#define USB_HS_DEVICE_NUMBER_OF_PHYSICAL_ENDPOINTS              (USB_HS_DEVICE_NUMBER_OF_LOGICAL_ENDPOINTS << 1)

#define USB_HS_DEVICE_NUMBER_OF_ENDPOINT_BUFFERS                2

#define USB_HS_DEVICE_RAM_BLOCK_SIZE_SHIFT                      6
#define USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES                      (0b1 << USB_HS_DEVICE_RAM_BLOCK_SIZE_SHIFT)

#define USB_HS_DEVICE_RAM_EP_CS_SIZE                            (USB_HS_DEVICE_NUMBER_OF_ENDPOINT_BUFFERS << 1)
#define USB_HS_DEVICE_RAM_EP_CS_LIST_SIZE                       (USB_HS_DEVICE_RAM_EP_CS_SIZE * USB_HS_DEVICE_NUMBER_OF_LOGICAL_ENDPOINTS)
#define USB_HS_DEVICE_RAM_EP_CS_LIST_ALIGNMENT                  256
#define USB_HS_DEVICE_RAM_EP_CS_INDEX(ep_num, ep_dir, ep_buf)   ((USB_HS_DEVICE_RAM_EP_CS_SIZE * ep_num) + (ep_dir << 1) + ep_buf)
#define USB_HS_DEVICE_RAM_EP_CS_RESET_VALUE_EP0                 0x00000000
#define USB_HS_DEVICE_RAM_EP_CS_RESET_VALUE_EPX                 0x40000000

#define USB_HS_DEVICE_RAM_DATA_SIZE_BYTES                       16192
#define USB_HS_DEVICE_RAM_DATA_ALIGNMENT                        USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES
#define USB_HS_DEVICE_RAM_DATA_SIZE_BLOCKS                      ((USB_HS_DEVICE_RAM_DATA_SIZE_BYTES + USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES - 1) / USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES)
#define USB_HS_DEVICE_RAM_DATA_OFFSET_BYTES                     (((uint32_t) &usb_hs_device_ram_data.data[0]) - ((uint32_t) &usb_hs_device_ram_data.ep_cs_list[0]))
#define USB_HS_DEVICE_RAM_DATA_OFFSET_BLOCKS                    (USB_HS_DEVICE_RAM_DATA_OFFSET_BYTES >> USB_HS_DEVICE_RAM_BLOCK_SIZE_SHIFT)
#define USB_HS_DEVICE_RAM_DATA_ADDRESS(block)                   ((block - USB_HS_DEVICE_RAM_DATA_OFFSET_BLOCKS) << USB_HS_DEVICE_RAM_BLOCK_SIZE_SHIFT)

#define USB_HS_DEVICE_RAM_MALLOC_TABLE_SIZE_BYTES               (USB_HS_DEVICE_RAM_DATA_SIZE_BLOCKS / MATH_U8_SIZE_BITS)

#define USB_HS_DEVICE_EP_PHY(ep_num, ep_dir)                    ((ep_num << 1) + (ep_dir))
#define USB_HS_DEVICE_EP_NUM(ep_phy)                            (ep_phy >> 1)
#define USB_HS_DEVICE_EP_DIR(ep_phy)                            (ep_phy % 2)

#define USB_HS_DEVICE_EPLISTSTART_MASK                          0x000FFF00
#define USB_HS_DEVICE_DATABUFSTART_MASK                         0xFFC00000

/*** USB HS DEVICE local structures ***/

/*******************************************************************/
typedef union {
    uint32_t value;
    struct {
        unsigned address_offset :11;
        unsigned n_bytes :15;
        unsigned type :1;
        unsigned rate_feedback_toggle_value :1;
        unsigned toggle_reset :1;
        unsigned stall :1;
        unsigned disable :1;
        unsigned active :1;
    } __attribute__((scalar_storage_order("little-endian"))) __attribute__((packed));
} USB_HS_DEVICE_endpoint_command_status_t;

/*******************************************************************/
typedef enum {
    USB_HS_DEVICE_ENDPOINT_BUFFER_0 = 0,
    USB_HS_DEVICE_ENDPOINT_BUFFER_1,
    USB_HS_DEVICE_ENDPOINT_BUFFER_LAST
} USB_HS_DEVICE_endpoint_buffer_t;

/*******************************************************************/
typedef enum {
    USB_HS_DEVICE_ENDPOINT_BUFFER_STATE_FREE = 0,
    USB_HS_DEVICE_ENDPOINT_BUFFER_STATE_HW,
    USB_HS_DEVICE_ENDPOINT_BUFFER_STATE_LAST
} USB_HS_DEVICE_endpoint_buffer_state_t;

/*******************************************************************/
typedef struct {
    USB_HS_DEVICE_endpoint_command_status_t ep_cs_list[USB_HS_DEVICE_RAM_EP_CS_LIST_SIZE] __attribute__((aligned(USB_HS_DEVICE_RAM_EP_CS_LIST_ALIGNMENT)));
    uint8_t zlp[USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES] __attribute__((aligned(USB_HS_DEVICE_RAM_DATA_ALIGNMENT)));
    uint8_t data[USB_HS_DEVICE_RAM_DATA_SIZE_BYTES] __attribute__((aligned(USB_HS_DEVICE_RAM_DATA_ALIGNMENT)));
} USB_HS_DEVICE_ram_data_t;

/*******************************************************************/
typedef void (*USB_HS_DEVICE_endpoint_cb_t)(void);

/*******************************************************************/
typedef struct {
    uint8_t registered;
    uint32_t irq_mask;
    uint32_t max_packet_size_bytes;
    uint32_t address_offset[USB_HS_DEVICE_ENDPOINT_BUFFER_LAST];
    uint8_t* dma_data;
    uint32_t dma_transfer_size_bytes;
    uint32_t dma_transfer_count_bytes;
    uint32_t dma_n_bytes;
    USB_HS_DEVICE_endpoint_cb_t callback;
} USB_HS_DEVICE_physical_endpoint_t;

/*******************************************************************/
typedef union {
    uint8_t all;
    struct {
        uint8_t in_data_phase_ongoing :1;
        uint8_t out_data_phase_ongoing :1;
        uint8_t init :1;
    } __attribute__((scalar_storage_order("big-endian"))) __attribute__((packed));
} USB_HS_DEVICE_flags_t;

/*******************************************************************/
typedef struct {
    USB_HS_DEVICE_setup_cb_t setup_callback;
    volatile uint32_t intstat;
    volatile USB_HS_DEVICE_flags_t flags;
    volatile USB_HS_DEVICE_physical_endpoint_t physical_endpoints[USB_HS_DEVICE_NUMBER_OF_PHYSICAL_ENDPOINTS];
    uint8_t ram_malloc_table[USB_HS_DEVICE_RAM_MALLOC_TABLE_SIZE_BYTES];
} USB_HS_DEVICE_context_t;

/*** USB HS DEVICE local global variables ***/

static volatile USB_HS_DEVICE_ram_data_t usb_hs_device_ram_data __attribute__((section (".bss_sram_usb")));

