Ludovic-Lesur/lpc55xx-drivers/src/usb_hs_device.c
static USB_HS_DEVICE_context_t usb_hs_device_ctx = {
    .setup_callback = NULL,
    .intstat = 0,
    .flags.all = 0,
    .ram_malloc_table = { [0 ... (USB_HS_DEVICE_RAM_MALLOC_TABLE_SIZE_BYTES - 1)] = 0x00 }
};

/*** USB HS DEVICE local functions declarations ***/

static void _USB_HS_DEVICE_status_irq_callback(void);
static void _USB_HS_DEVICE_control_endpoint_out_irq_callback(uint8_t ep_phy);
static void _USB_HS_DEVICE_control_endpoint_in_irq_callback(uint8_t ep_phy);
static void _USB_HS_DEVICE_data_endpoint_irq_callback(uint8_t ep_phy);
static void _USB_HS_DEVICE_write(uint8_t ep_phy, uint8_t ep_num, uint8_t ep_dir);
static USB_HS_DEVICE_endpoint_buffer_t _USB_HS_DEVICE_get_endpoint_buffer(uint8_t ep_phy, USB_HS_DEVICE_endpoint_buffer_state_t buffer_state);

/*** USB HS DEVICE local functions ***/

/*******************************************************************/
void USB1_IRQHandler(void) {
    // Local variables.
    uint8_t ep_phy = 0;
    // Capture interrupts flags.
    usb_hs_device_ctx.intstat |= (USB_HS_DEVICE->INTSTAT);
    // Clear all flags.
    USB_HS_DEVICE->INTSTAT |= 0xC0000FFF;
    // Check device interrupt.
    _USB_HS_DEVICE_status_irq_callback();
    // Endpoints loop.
    for (ep_phy = 0; ep_phy < USB_HS_DEVICE_NUMBER_OF_PHYSICAL_ENDPOINTS; ep_phy++) {
        // Check software flag.
        if (((usb_hs_device_ctx.intstat) & (usb_hs_device_ctx.physical_endpoints[ep_phy].irq_mask)) != 0) {
            // Clear software flag.
            usb_hs_device_ctx.intstat &= ~(usb_hs_device_ctx.physical_endpoints[ep_phy].irq_mask);
            // Check if endpoint is registered.
            if (usb_hs_device_ctx.physical_endpoints[ep_phy].registered != 0) {
                // Specific control endpoint handling.
                switch (ep_phy) {
                case (USB_HS_DEVICE_EP_PHY(0, USB_HS_DEVICE_ENDPOINT_DIRECTION_OUT)):
                    _USB_HS_DEVICE_control_endpoint_out_irq_callback(ep_phy);
                    break;
                case (USB_HS_DEVICE_EP_PHY(0, USB_HS_DEVICE_ENDPOINT_DIRECTION_IN)):
                    _USB_HS_DEVICE_control_endpoint_in_irq_callback(ep_phy);
                    break;
                default:
                    _USB_HS_DEVICE_data_endpoint_irq_callback(ep_phy);
                    break;
                }
            }
        }
    }
}

/*******************************************************************/
static void _USB_HS_DEVICE_status_irq_callback(void) {
    // Check flag.
    if ((usb_hs_device_ctx.intstat & (0b1 << 31)) != 0) {
        // Clear flag.
        usb_hs_device_ctx.intstat &= ~(0b1 << 31);
        // Clear status flags.
        USB_HS_DEVICE->DEVCMDSTAT |= (0b111 << 24);
    }
}

/*******************************************************************/
static void _USB_HS_DEVICE_control_endpoint_out_irq_callback(uint8_t ep_phy) {
    // Local variables.
    uint8_t ep0_out_cs_index = USB_HS_DEVICE_RAM_EP_CS_INDEX(0, USB_HS_DEVICE_ENDPOINT_DIRECTION_OUT, USB_HS_DEVICE_ENDPOINT_BUFFER_0);
    uint8_t ep0_in_cs_index = USB_HS_DEVICE_RAM_EP_CS_INDEX(0, USB_HS_DEVICE_ENDPOINT_DIRECTION_IN, USB_HS_DEVICE_ENDPOINT_BUFFER_0);
    USB_HS_DEVICE_request_operation_t request_operation = USB_HS_DEVICE_REQUEST_OPERATION_NOT_SUPPORTED;
    // Check setup flag.
    if (((USB_HS_DEVICE->DEVCMDSTAT) & (0b1 << 8)) != 0) {
        // Set endpoint state.
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].active = 0;
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].stall = 0;
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].active = 0;
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].stall = 0;
        // Update local flags.
        usb_hs_device_ctx.flags.out_data_phase_ongoing = 0;
        usb_hs_device_ctx.flags.in_data_phase_ongoing = 0;
        // Clear setup flag.
        USB_HS_DEVICE->DEVCMDSTAT |= (0b1 << 8);
        // Call setup callback.
        if (usb_hs_device_ctx.setup_callback != NULL) {
            usb_hs_device_ctx.setup_callback(&request_operation);
        }
        switch (request_operation) {
        case USB_HS_DEVICE_REQUEST_OPERATION_READ:
            // Start IN data phase.
            // Note: NBytes and active bit are set by the setup callback which just called the write function.
            usb_hs_device_ctx.flags.in_data_phase_ongoing = 1;
            break;
        case USB_HS_DEVICE_REQUEST_OPERATION_WRITE:
            // Start OUT data phase.
            usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].active = 1;
            usb_hs_device_ctx.flags.out_data_phase_ongoing = 1;
            break;
        case USB_HS_DEVICE_REQUEST_OPERATION_WRITE_NO_DATA:
            // Activate IN endpoint.
            usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].active = 1;
            usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].n_bytes = 0;
            break;
        default:
            // Stall control endpoint.
            usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].stall = 1;
            usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].stall = 1;
            break;
        }
    }
    else if (usb_hs_device_ctx.flags.out_data_phase_ongoing != 0) {
        // Activate IN endpoint.
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].active = 1;
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].stall = 1;
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].n_bytes = 0;
        // Reset OUT endpoint for next reception.
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].active = 0;
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].stall = 1;
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].n_bytes = (usb_hs_device_ctx.physical_endpoints[ep_phy].max_packet_size_bytes);
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].address_offset = (usb_hs_device_ctx.physical_endpoints[ep_phy].address_offset[USB_HS_DEVICE_ENDPOINT_BUFFER_0]);
        // Call applicative callback.
        if (usb_hs_device_ctx.physical_endpoints[ep_phy].callback != NULL) {
            usb_hs_device_ctx.physical_endpoints[ep_phy].callback();
        }
    }
    else if (usb_hs_device_ctx.flags.in_data_phase_ongoing != 0) {
        // Case of OUT ZLP acknowledge.
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].active = 1;
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].stall = 1;
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].n_bytes = (usb_hs_device_ctx.physical_endpoints[ep_phy].max_packet_size_bytes + 1);
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].active = 0;
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].stall = 1;
        // Reset flag.
        usb_hs_device_ctx.flags.in_data_phase_ongoing = 0;
    }
    else {
        // Stall endpoint.
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].active = 0;
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].stall = 1;
    }
}

/*******************************************************************/
static void _USB_HS_DEVICE_control_endpoint_in_irq_callback(uint8_t ep_phy) {
    // Local variables.
    uint8_t ep0_out_cs_index = USB_HS_DEVICE_RAM_EP_CS_INDEX(0, USB_HS_DEVICE_ENDPOINT_DIRECTION_OUT, USB_HS_DEVICE_ENDPOINT_BUFFER_0);
    uint8_t ep0_in_cs_index = USB_HS_DEVICE_RAM_EP_CS_INDEX(0, USB_HS_DEVICE_ENDPOINT_DIRECTION_IN, USB_HS_DEVICE_ENDPOINT_BUFFER_0);
    uint8_t ep0_out_phy = USB_HS_DEVICE_EP_PHY(0, USB_HS_DEVICE_ENDPOINT_DIRECTION_OUT);
    // Check data phase.
    if (usb_hs_device_ctx.flags.in_data_phase_ongoing != 0) {
        // Update DMA transfer status.
        usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_count_bytes += usb_hs_device_ctx.physical_endpoints[ep_phy].dma_n_bytes;
        // Address has been incremented by hardware.
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].address_offset = (usb_hs_device_ctx.physical_endpoints[ep_phy].address_offset[USB_HS_DEVICE_ENDPOINT_BUFFER_0]);
        // Check if all data has been sent.
        if (usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_count_bytes >= usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_size_bytes) {
            // Activate OUT endpoint.
            usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].active = 1;
            usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].stall = 1;
            usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].n_bytes = (usb_hs_device_ctx.physical_endpoints[ep0_out_phy].max_packet_size_bytes + 1);
            // Reset IN endpoint for next transmission.
            usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].active = 0;
            usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].stall = 1;
            usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].n_bytes = 0;
            // Call applicative callback.
            if (usb_hs_device_ctx.physical_endpoints[ep_phy].callback != NULL) {
                usb_hs_device_ctx.physical_endpoints[ep_phy].callback();
            }
        }
        else {
           // Send next packet.
           _USB_HS_DEVICE_write(ep_phy, 0, USB_HS_DEVICE_ENDPOINT_DIRECTION_IN);
        }
    }
    else if (usb_hs_device_ctx.flags.out_data_phase_ongoing != 0) {
        // Case of IN ZLP acknowledge.
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].active = 1;
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].stall = 1;
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].n_bytes = 0;
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].active = 0;
        usb_hs_device_ram_data.ep_cs_list[ep0_out_cs_index].stall = 1;
        // Reset flag.
        usb_hs_device_ctx.flags.out_data_phase_ongoing = 0;
    }
    else {
        // Stall endpoint.
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].active = 0;
        usb_hs_device_ram_data.ep_cs_list[ep0_in_cs_index].stall = 1;
    }
}

/*******************************************************************/
static void _USB_HS_DEVICE_data_endpoint_irq_callback(uint8_t ep_phy) {
    // Local variables.
    uint8_t ep_num = USB_HS_DEVICE_EP_NUM(ep_phy);
    uint8_t ep_dir = USB_HS_DEVICE_EP_DIR(ep_phy);
    USB_HS_DEVICE_endpoint_buffer_t ep_buffer = _USB_HS_DEVICE_get_endpoint_buffer(ep_phy, USB_HS_DEVICE_ENDPOINT_BUFFER_STATE_FREE);
    uint8_t ep_cs_index = USB_HS_DEVICE_RAM_EP_CS_INDEX(ep_num, ep_dir, ep_buffer);
    // Check direction.
    if (ep_dir == USB_HS_DEVICE_ENDPOINT_DIRECTION_OUT) {
        // Store number of received bytes.
        usb_hs_device_ctx.physical_endpoints[ep_phy].dma_n_bytes = usb_hs_device_ram_data.ep_cs_list[ep_cs_index].n_bytes;
        // Prepare OUT endpoint for next reception.
        usb_hs_device_ram_data.ep_cs_list[ep_cs_index].active = 1;
        usb_hs_device_ram_data.ep_cs_list[ep_cs_index].address_offset = (usb_hs_device_ctx.physical_endpoints[ep_phy].address_offset[ep_buffer]);
        usb_hs_device_ram_data.ep_cs_list[ep_cs_index].n_bytes = (usb_hs_device_ctx.physical_endpoints[ep_phy].max_packet_size_bytes);
        // Call applicative callback if not NULL.
        if (usb_hs_device_ctx.physical_endpoints[ep_phy].callback != NULL) {
            usb_hs_device_ctx.physical_endpoints[ep_phy].callback();
        }
    }
    else {
        // Update DMA transfer status.
        usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_count_bytes += usb_hs_device_ctx.physical_endpoints[ep_phy].dma_n_bytes;
        // Address has been incremented by hardware.
        usb_hs_device_ram_data.ep_cs_list[ep_cs_index].address_offset = (usb_hs_device_ctx.physical_endpoints[ep_phy].address_offset[ep_buffer]);
        // Check if all data has been sent.
        if (usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_count_bytes >= usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_size_bytes) {
            // Reset IN endpoint for next transmission.
            usb_hs_device_ram_data.ep_cs_list[ep_cs_index].active = 0;
            usb_hs_device_ram_data.ep_cs_list[ep_cs_index].n_bytes = 0;
            // Call applicative callback.
            if (usb_hs_device_ctx.physical_endpoints[ep_phy].callback != NULL) {
                usb_hs_device_ctx.physical_endpoints[ep_phy].callback();
            }
        }
        else {
           // Send next packet.
           _USB_HS_DEVICE_write(ep_phy, ep_num, USB_HS_DEVICE_ENDPOINT_DIRECTION_IN);
        }
    }
}

/*******************************************************************/
static USB_HS_DEVICE_status_t _USB_HS_DEVICE_ram_malloc(uint32_t ram_size_bytes, uint32_t* ram_address_offset_blocks) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    uint32_t ram_size_blocks = 0;
    uint32_t free_size_blocks = 0;
    uint32_t free_start_block = 0;
    uint32_t free_end_block = 0;
    uint32_t block_idx = 0;
    uint8_t byte_idx = 0;
    uint8_t bit_idx = 0;
    // Check parameters.
    if ((ram_size_bytes == 0) || (ram_size_bytes > USB_HS_DEVICE_RAM_DATA_SIZE_BYTES)) {
        status = USB_HS_DEVICE_ERROR_RAM_MALLOC_SIZE;
        goto errors;
    }
    if (ram_address_offset_blocks == NULL) {
        status = USB_HS_DEVICE_ERROR_NULL_PARAMETER;
        goto errors;
    }
    // Compute number of blocks.
    ram_size_blocks = ((ram_size_bytes + USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES - 1) / (USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES));
    // Search first free location with required amount of bytes.
    for (block_idx = 0; block_idx < USB_HS_DEVICE_RAM_DATA_SIZE_BLOCKS; block_idx++) {
        // Compute indexes.
        byte_idx = (block_idx / MATH_U8_SIZE_BITS);
        bit_idx = (block_idx % MATH_U8_SIZE_BITS);
        // Check if block is free.
        if ((usb_hs_device_ctx.ram_malloc_table[byte_idx] & (0b1 << bit_idx)) != 0) {
            // Reset size since we search a contiguous RAM space.
            free_size_blocks = 0;
            free_start_block = (block_idx + 1);
        }
        else {
            // Increment free size.
            free_size_blocks++;
        }
        // Exit if required size has been reached.
        if (free_size_blocks >= ram_size_blocks) break;
    }
    free_end_block = (block_idx + 1);
    // Check if memory space has been found.
    if (free_size_blocks < ram_size_blocks) {
        status = USB_HS_DEVICE_ERROR_RAM_MALLOC;
        goto errors;
    }
    // Update allocation status.
    for (block_idx = free_start_block; block_idx < free_end_block; block_idx++) {
        // Compute indexes.
        byte_idx = (block_idx / MATH_U8_SIZE_BITS);
        bit_idx = (block_idx % MATH_U8_SIZE_BITS);
        // Set bit.
        usb_hs_device_ctx.ram_malloc_table[byte_idx] |= (0b1 << bit_idx);
    }
    // Update allocated address.
    (*ram_address_offset_blocks) = (USB_HS_DEVICE_RAM_DATA_OFFSET_BLOCKS + free_start_block);
errors:
    return status;
}

/*******************************************************************/
static USB_HS_DEVICE_status_t _USB_HS_DEVICE_ram_free(uint32_t ram_address_offset_blocks, uint32_t ram_size_bytes) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    uint32_t ram_size_blocks = 0;
    uint32_t block_idx = 0;
    uint8_t byte_idx = 0;
    uint8_t bit_idx = 0;
    uint8_t idx = 0;
    // Check parameters.
    if (ram_address_offset_blocks >= USB_HS_DEVICE_RAM_DATA_SIZE_BLOCKS) {
        status = USB_HS_DEVICE_ERROR_RAM_FREE_ADDRESS;
        goto errors;
    }
    if ((ram_size_bytes == 0) || (ram_size_bytes > USB_HS_DEVICE_RAM_DATA_SIZE_BYTES)) {
        status = USB_HS_DEVICE_ERROR_RAM_FREE_SIZE;
        goto errors;
    }
    // Compute number of blocks.
    ram_size_blocks = ((ram_size_bytes + USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES - 1) / (USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES));
    // Update allocation status.
    for (block_idx = ram_address_offset_blocks; block_idx < (ram_address_offset_blocks + ram_size_blocks); block_idx++) {
        // Compute indexes.
        byte_idx = (block_idx / MATH_U8_SIZE_BITS);
        bit_idx = (block_idx % MATH_U8_SIZE_BITS);
        // Set bit.
        usb_hs_device_ctx.ram_malloc_table[byte_idx] &= ~(0b1 << bit_idx);
        // Clear RAM.
        for (idx = 0; idx < USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES; idx++) {
            usb_hs_device_ram_data.data[(block_idx << USB_HS_DEVICE_RAM_BLOCK_SIZE_SHIFT) + idx] = 0x00;
        }
    }
errors:
    return status;
}

/*******************************************************************/
static void _USB_HS_DEVICE_reset_endpoint(uint8_t ep_phy) {
    // Local variables.
    uint8_t ep_num = USB_HS_DEVICE_EP_NUM(ep_phy);
    uint8_t ep_dir = USB_HS_DEVICE_EP_DIR(ep_phy);
    uint8_t ram_endpoint_idx_0 = USB_HS_DEVICE_RAM_EP_CS_INDEX(ep_num, ep_dir, USB_HS_DEVICE_ENDPOINT_BUFFER_0);
    uint8_t ram_endpoint_idx_1 = USB_HS_DEVICE_RAM_EP_CS_INDEX(ep_num, ep_dir, USB_HS_DEVICE_ENDPOINT_BUFFER_1);
    // Reset physical endpoint.
    usb_hs_device_ctx.physical_endpoints[ep_phy].registered = 0;
    usb_hs_device_ctx.physical_endpoints[ep_phy].irq_mask = 0;
    usb_hs_device_ctx.physical_endpoints[ep_phy].max_packet_size_bytes = 0;
    usb_hs_device_ctx.physical_endpoints[ep_phy].address_offset[USB_HS_DEVICE_ENDPOINT_BUFFER_0] = 0;
    usb_hs_device_ctx.physical_endpoints[ep_phy].address_offset[USB_HS_DEVICE_ENDPOINT_BUFFER_1] = 0;
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_data = NULL;
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_count_bytes = 0;
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_size_bytes = 0;
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_n_bytes = 0;
    usb_hs_device_ctx.physical_endpoints[ep_phy].callback = NULL;
    // Reset endpoint descriptor in RAM.
    if (USB_HS_DEVICE_EP_NUM(ep_phy) == 0) {
        // Specific value for control endpoint.
        usb_hs_device_ram_data.ep_cs_list[ram_endpoint_idx_0].value = USB_HS_DEVICE_RAM_EP_CS_RESET_VALUE_EP0;
        usb_hs_device_ram_data.ep_cs_list[ram_endpoint_idx_1].value = USB_HS_DEVICE_RAM_EP_CS_RESET_VALUE_EP0;
    }
    else {
        // Default value with disable bit set.
        usb_hs_device_ram_data.ep_cs_list[ram_endpoint_idx_0].value = USB_HS_DEVICE_RAM_EP_CS_RESET_VALUE_EPX;
        usb_hs_device_ram_data.ep_cs_list[ram_endpoint_idx_1].value = USB_HS_DEVICE_RAM_EP_CS_RESET_VALUE_EPX;
    }
}

/*******************************************************************/
static USB_HS_DEVICE_status_t _USB_HS_DEVICE_check_endpoint(USB_HS_DEVICE_endpoint_t* endpoint) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    // Check endpoint.
    if (endpoint == NULL) {
        status = USB_HS_DEVICE_ERROR_NULL_PARAMETER;
        goto errors;
    }
    if ((endpoint->number) >= USB_HS_DEVICE_NUMBER_OF_LOGICAL_ENDPOINTS) {
        status = USB_HS_DEVICE_ERROR_ENDPOINT_NUMBER;
        goto errors;
    }
    if ((endpoint->direction) >= USB_HS_DEVICE_ENDPOINT_DIRECTION_LAST) {
        status = USB_HS_DEVICE_ERROR_ENDPOINT_DIRECTION;
        goto errors;
    }
errors:
    return status;
}

/*******************************************************************/
static USB_HS_DEVICE_endpoint_buffer_t _USB_HS_DEVICE_get_endpoint_buffer(uint8_t ep_phy, USB_HS_DEVICE_endpoint_buffer_state_t buffer_state) {
    // Local variables.
    USB_HS_DEVICE_endpoint_buffer_t ep_buffer = USB_HS_DEVICE_ENDPOINT_BUFFER_0;
    // Check endpoint number.
    if (USB_HS_DEVICE_EP_NUM(ep_phy) != 0) {
        // Check state.
        if (buffer_state == USB_HS_DEVICE_ENDPOINT_BUFFER_STATE_FREE) {
            ep_buffer = (((USB_HS_DEVICE->EPINUSE) & (0b1 << ep_phy)) == 0) ? USB_HS_DEVICE_ENDPOINT_BUFFER_1 : USB_HS_DEVICE_ENDPOINT_BUFFER_0;
        }
        else {
            ep_buffer = (((USB_HS_DEVICE->EPINUSE) & (0b1 << ep_phy)) == 0) ? USB_HS_DEVICE_ENDPOINT_BUFFER_0 : USB_HS_DEVICE_ENDPOINT_BUFFER_1;
        }
    }
    return ep_buffer;
}

/*******************************************************************/
static void _USB_HS_DEVICE_write(uint8_t ep_phy, uint8_t ep_num, uint8_t ep_dir) {
    // Local variables.
    uint8_t ep_cs_index = 0;
    uint32_t ep_ram_data_address = 0;
    uint32_t ep_max_packet_size = usb_hs_device_ctx.physical_endpoints[ep_phy].max_packet_size_bytes;
    uint32_t dma_transfer_size = usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_size_bytes;
    uint32_t dma_transfer_count = usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_count_bytes;
    uint32_t dma_remaining_bytes = (dma_transfer_size - dma_transfer_count);
    uint32_t idx = 0;
    // Get RAM address.
    ep_cs_index = USB_HS_DEVICE_RAM_EP_CS_INDEX(ep_num, ep_dir, _USB_HS_DEVICE_get_endpoint_buffer(ep_phy, USB_HS_DEVICE_ENDPOINT_BUFFER_STATE_HW));
    ep_ram_data_address = (usb_hs_device_ram_data.ep_cs_list[ep_cs_index].address_offset - USB_HS_DEVICE_RAM_DATA_OFFSET_BLOCKS) << USB_HS_DEVICE_RAM_BLOCK_SIZE_SHIFT;
    // Compute single transfer size.
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_n_bytes = ((dma_remaining_bytes > ep_max_packet_size) ? ep_max_packet_size : dma_remaining_bytes);
    // Copy data in USB RAM.
    for (idx = 0; idx < (usb_hs_device_ctx.physical_endpoints[ep_phy].dma_n_bytes); idx++) {
        usb_hs_device_ram_data.data[ep_ram_data_address + idx] = usb_hs_device_ctx.physical_endpoints[ep_phy].dma_data[dma_transfer_count + idx];
    }
    // Update number of bytes.
    usb_hs_device_ram_data.ep_cs_list[ep_cs_index].n_bytes = usb_hs_device_ctx.physical_endpoints[ep_phy].dma_n_bytes;
    // Activate endpoint.
    usb_hs_device_ram_data.ep_cs_list[ep_cs_index].active = 1;
}

/*** USB HS DEVICE functions ***/

