Ludovic-Lesur/lpc55xx-drivers/src/usb_hs_device.c
/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_init(uint8_t nvic_priority) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    USB_HS_PHY_status_t usb_hs_phy_status = USB_HS_PHY_SUCCESS;
    uint32_t idx = 0;
    // Check state.
    if (usb_hs_device_ctx.flags.init != 0) {
        status = USB_HS_DEVICE_ERROR_ALREADY_INITIALIZED;
        goto errors;
    }
    // Init context.
    usb_hs_device_ctx.intstat = 0;
    usb_hs_device_ctx.flags.all = 0;
    for (idx = 0; idx < USB_HS_DEVICE_RAM_MALLOC_TABLE_SIZE_BYTES; idx++) {
        usb_hs_device_ctx.ram_malloc_table[idx] = 0x00;
    }
    // Init PHY.
    usb_hs_phy_status = USB_HS_PHY_init();
    USB_HS_PHY_exit_error(USB_HS_DEVICE_ERROR_BASE_USB_HS_PHY);
    // Enable peripheral clock.
    SYSCON_set_peripheral_clock(SYSCON_PERIPHERAL_USB1_RAM, 1);
    SYSCON_set_peripheral_clock(SYSCON_PERIPHERAL_USB1_DEV, 1);
    // Set device mode.
    SYSCON_set_peripheral_clock(SYSCON_PERIPHERAL_USB1_HOST, 1);
    USB_HS_HOST->PORTMODE |= (0b1 << 16);
    SYSCON_set_peripheral_clock(SYSCON_PERIPHERAL_USB1_HOST, 0);
    // Reset blocks.
    SYSCON_reset_peripheral(SYSCON_PERIPHERAL_USB1_RAM);
    SYSCON_reset_peripheral(SYSCON_PERIPHERAL_USB1_DEV);
    // Enable DP pull-up resistor.
    USB_HS_DEVICE->DEVCMDSTAT |= (0b1 << 16);
    // Reset registers.
    USB_HS_DEVICE->EPINUSE = 0;
    USB_HS_DEVICE->EPSKIP = 0;
    // Set endpoint command and status list and data addresses.
    USB_HS_DEVICE->EPLISTSTART = ((uint32_t) &(usb_hs_device_ram_data.ep_cs_list[0]) & USB_HS_DEVICE_EPLISTSTART_MASK);
    USB_HS_DEVICE->DATABUFSTART = (((uint32_t) &(usb_hs_device_ram_data)) & USB_HS_DEVICE_DATABUFSTART_MASK);
    // Disable LPM.
    USB_HS_DEVICE->DEVCMDSTAT &= ~(0b1 << 11);
    // Set interrupts priority.
    NVIC_set_priority(NVIC_INTERRUPT_USB1, nvic_priority);
    // Disable NAK interrupts.
    USB_HS_DEVICE->DEVCMDSTAT &= ~(0b1111 << 12);
    // Always start with address 0x00 for enumeration.
    status = USB_HS_DEVICE_set_address(0x00);
    if (status != USB_HS_DEVICE_SUCCESS) goto errors;
    // Reset peripheral.
    status = USB_HS_DEVICE_reset();
    if (status != USB_HS_DEVICE_SUCCESS) goto errors;
    // Update initialization flag.
    usb_hs_device_ctx.flags.init = 1;
errors:
    // Disable device by default.
    USB_HS_DEVICE_stop();
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_de_init(void) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    USB_HS_PHY_status_t usb_hs_phy_status = USB_HS_PHY_SUCCESS;
    // Check state.
    if (usb_hs_device_ctx.flags.init == 0) {
        status = USB_HS_DEVICE_ERROR_UNINITIALIZED;
        goto errors;
    }
    // Disable peripheral clock.
    SYSCON_set_peripheral_clock(SYSCON_PERIPHERAL_USB1_RAM, 0);
    SYSCON_set_peripheral_clock(SYSCON_PERIPHERAL_USB1_DEV, 0);
    SYSCON_set_peripheral_clock(SYSCON_PERIPHERAL_USB1_HOST, 0);
    // Release PHY.
    usb_hs_phy_status = USB_HS_PHY_de_init();
    USB_HS_PHY_exit_error(USB_HS_DEVICE_ERROR_BASE_USB_HS_PHY);
errors:
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_reset(void) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    uint8_t idx = 0;
    // Flush endpoints list.
    for (idx = 0; idx < USB_HS_DEVICE_NUMBER_OF_PHYSICAL_ENDPOINTS; idx++) {
        _USB_HS_DEVICE_reset_endpoint(idx);
    }
    // Reset ZLP.
    for (idx = 0; idx < USB_HS_DEVICE_RAM_BLOCK_SIZE_BYTES; idx++) {
        usb_hs_device_ram_data.zlp[idx] = 0x00;
    }
    // Free all USB RAM.
    status = _USB_HS_DEVICE_ram_free(0, USB_HS_DEVICE_RAM_DATA_SIZE_BYTES);
    if (status != USB_HS_DEVICE_SUCCESS) goto errors;
errors:
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_register_setup_callback(USB_HS_DEVICE_setup_cb_t setup_callback) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    // Check parameter.
    if (setup_callback == NULL) {
        status = USB_HS_DEVICE_ERROR_NULL_PARAMETER;
        goto errors;
    }
    // Update local pointer.
    usb_hs_device_ctx.setup_callback = setup_callback;
errors:
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_register_endpoint(USB_HS_DEVICE_endpoint_t* endpoint) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    uint8_t ep_phy = USB_HS_DEVICE_EP_PHY((endpoint->number), (endpoint->direction));
    uint8_t ep_cs_buffer0_index = USB_HS_DEVICE_RAM_EP_CS_INDEX((endpoint->number), (endpoint->direction), USB_HS_DEVICE_ENDPOINT_BUFFER_0);
    uint8_t ep_cs_buffer1_index = USB_HS_DEVICE_RAM_EP_CS_INDEX((endpoint->number), (endpoint->direction), USB_HS_DEVICE_ENDPOINT_BUFFER_1);
    uint32_t ram_address_offset_blocks = 0;
    // Check state.
    if (usb_hs_device_ctx.flags.init == 0) {
        status = USB_HS_DEVICE_ERROR_UNINITIALIZED;
        goto errors;
    }
    // Check parameter.
    status = _USB_HS_DEVICE_check_endpoint(endpoint);
    if (status != USB_HS_DEVICE_SUCCESS) goto errors;
    // Check if endpoint is available.
    if (usb_hs_device_ctx.physical_endpoints[ep_phy].registered != 0) {
        status = USB_HS_DEVICE_ERROR_ENDPOINT_ALREADY_REGISTERED;
        goto errors;
    }
    // Check index.
    if ((endpoint->number) == 0) {
        // Check type.
        if ((endpoint->transfer_type) != USB_HS_DEVICE_ENDPOINT_TRANSFER_TYPE_CONTROL) {
            status = USB_HS_DEVICE_ERROR_ENDPOINT_TRANSFER_TYPE;
            goto errors;
        }
    }
    else {
        // Set type on both buffers.
        switch (endpoint->transfer_type) {
        case USB_HS_DEVICE_ENDPOINT_TRANSFER_TYPE_BULK:
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].type = 0;
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].rate_feedback_toggle_value = 0;
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].type = 0;
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].rate_feedback_toggle_value = 0;
            break;
        case USB_HS_DEVICE_ENDPOINT_TRANSFER_TYPE_ISOCHRONOUS:
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].type = 1;
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].rate_feedback_toggle_value = 0;
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].type = 1;
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].rate_feedback_toggle_value = 0;
            break;
        case USB_HS_DEVICE_ENDPOINT_TRANSFER_TYPE_INTERRUPT:
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].type = 1;
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].rate_feedback_toggle_value = 1;
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].type = 1;
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].rate_feedback_toggle_value = 1;
            break;
        default:
            status = USB_HS_DEVICE_ERROR_ENDPOINT_TRANSFER_TYPE;
            goto errors;
        }
    }
    // Allocate RAM for buffer 0.
    status = _USB_HS_DEVICE_ram_malloc((endpoint->max_packet_size_bytes), &ram_address_offset_blocks);
    if (status != USB_HS_DEVICE_SUCCESS) goto errors;
    // Update address offset.
    usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].address_offset = ram_address_offset_blocks;
    // Enable buffer 0.
    usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].disable = 0;
    usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].stall = 0;
    // Specific exception for EP0-IN.
    if ((endpoint->number != 0) || (endpoint->direction != USB_HS_DEVICE_ENDPOINT_DIRECTION_IN)) {
        // Allocate RAM for buffer 1.
        status = _USB_HS_DEVICE_ram_malloc((endpoint->max_packet_size_bytes), &ram_address_offset_blocks);
        if (status != USB_HS_DEVICE_SUCCESS) goto errors;
        // Update address offset.
        usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].address_offset = ram_address_offset_blocks;
        // Enable buffer 1.
        usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].disable = 0;
        usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].stall = 0;
    }
    // Use double buffer mode for data endpoints.
    if ((endpoint->number) != 0) {
        USB_HS_DEVICE->EPBUFCFG |= (0b1 << ((USB_HS_DEVICE_ENDPOINT_DIRECTION_LAST * (endpoint->number)) + (endpoint->direction)));
    }
    // Activate out endpoint.
    if ((endpoint->direction) == USB_HS_DEVICE_ENDPOINT_DIRECTION_OUT) {
        // Buffer 0.
        usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].n_bytes = (endpoint->max_packet_size_bytes);
        usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].active = 1;
        // Buffer 1.
        if ((endpoint->number) != 0) {
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].n_bytes = (endpoint->max_packet_size_bytes);
            usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].active = 1;
        }
    }
    // Update local list.
    usb_hs_device_ctx.physical_endpoints[ep_phy].registered = 1;
    usb_hs_device_ctx.physical_endpoints[ep_phy].irq_mask = (0b1 << ep_phy);
    usb_hs_device_ctx.physical_endpoints[ep_phy].max_packet_size_bytes = (endpoint->max_packet_size_bytes);
    usb_hs_device_ctx.physical_endpoints[ep_phy].address_offset[USB_HS_DEVICE_ENDPOINT_BUFFER_0] = usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].address_offset;
    usb_hs_device_ctx.physical_endpoints[ep_phy].address_offset[USB_HS_DEVICE_ENDPOINT_BUFFER_1] = usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].address_offset;
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_data = NULL;
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_count_bytes = 0;
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_size_bytes = 0;
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_n_bytes = usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].n_bytes;
    usb_hs_device_ctx.physical_endpoints[ep_phy].callback = (endpoint->callback);
    // Enable corresponding interrupt.
    USB_HS_DEVICE->INTEN |= (0b1 << ep_phy);
errors:
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_unregister_endpoint(USB_HS_DEVICE_endpoint_t* endpoint) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    uint8_t ep_phy = USB_HS_DEVICE_EP_PHY((endpoint->number), (endpoint->direction));
    uint8_t ep_cs_buffer0_index = USB_HS_DEVICE_RAM_EP_CS_INDEX((endpoint->number), (endpoint->direction), USB_HS_DEVICE_ENDPOINT_BUFFER_0);
    uint8_t ep_cs_buffer1_index = USB_HS_DEVICE_RAM_EP_CS_INDEX((endpoint->number), (endpoint->direction), USB_HS_DEVICE_ENDPOINT_BUFFER_1);
    // Check state.
    if (usb_hs_device_ctx.flags.init == 0) {
        status = USB_HS_DEVICE_ERROR_UNINITIALIZED;
        goto errors;
    }
    // Check parameter.
    status = _USB_HS_DEVICE_check_endpoint(endpoint);
    if (status != USB_HS_DEVICE_SUCCESS) goto errors;
    // Check if endpoint is available.
    if (usb_hs_device_ctx.physical_endpoints[ep_phy].registered == 0) {
        status = USB_HS_DEVICE_ERROR_ENDPOINT_NOT_REGISTERED;
        goto errors;
    }
    // Free RAM for buffer 0.
    status = _USB_HS_DEVICE_ram_free(usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer0_index].address_offset, (endpoint->max_packet_size_bytes));
    if (status != USB_HS_DEVICE_SUCCESS) goto errors;
    // Free RAM for buffer 1.
    status = _USB_HS_DEVICE_ram_free(usb_hs_device_ram_data.ep_cs_list[ep_cs_buffer1_index].address_offset, (endpoint->max_packet_size_bytes));
    if (status != USB_HS_DEVICE_SUCCESS) goto errors;
    // Reset endpoint.
    _USB_HS_DEVICE_reset_endpoint(ep_phy);
errors:
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_set_address(uint8_t device_address) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    uint32_t reg_value = 0;
    // Check address.
    if (device_address > USB_HS_DEVICE_ADDRESS_MAX) {
        status = USB_HS_DEVICE_ERROR_ADDRESS;
        goto errors;
    }
    // Set device address.
    reg_value = ((USB_HS_DEVICE->DEVCMDSTAT) & (~USB_HS_DEVICE_ADDRESS_MASK));
    reg_value |= (device_address & USB_HS_DEVICE_ADDRESS_MASK);
    USB_HS_DEVICE->DEVCMDSTAT = reg_value;
errors:
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_start(void) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    SYSTICK_status_t systick_status = SYSTICK_SUCCESS;
    // Check state.
    if (usb_hs_device_ctx.flags.init == 0) {
        status = USB_HS_DEVICE_ERROR_UNINITIALIZED;
        goto errors;
    }
    // Check setup callback.
    if (usb_hs_device_ctx.setup_callback == NULL) {
        status = USB_HS_DEVICE_ERROR_NULL_PARAMETER;
        goto errors;
    }
    // Delay for host to detect disconnection.
    systick_status = SYSTICK_delay_microseconds(USB_HS_DEVICE_DISCONNECT_DELAY_US);
    SYSTICK_exit_error(USB_HS_DEVICE_ERROR_BASE_SYSTICK);
    // Clear pending interrupts.
    NVIC_clear_pending_interrupt(NVIC_INTERRUPT_USB1);
    // Clear flags.
    USB_HS_DEVICE->INTSTAT |= 0xC0000FFF;
    // Enable device status interrupt
    USB_HS_DEVICE->INTEN |= (0b1 << 31);
    NVIC_enable_interrupt(NVIC_INTERRUPT_USB1);
    // Enable device.
    USB_HS_DEVICE->DEVCMDSTAT |= (0b1 << 7);
errors:
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_stop(void) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    SYSTICK_status_t systick_status = SYSTICK_SUCCESS;
    // Check state.
    if (usb_hs_device_ctx.flags.init == 0) {
        status = USB_HS_DEVICE_ERROR_UNINITIALIZED;
        goto errors;
    }
    // Disable interrupts.
    NVIC_disable_interrupt(NVIC_INTERRUPT_USB1);
    // Disable device.
    USB_HS_DEVICE->DEVCMDSTAT &= ~(0b1 << 7);
    // Delay for host to detect disconnection.
    systick_status = SYSTICK_delay_microseconds(USB_HS_DEVICE_DISCONNECT_DELAY_US);
    SYSTICK_exit_error(USB_HS_DEVICE_ERROR_BASE_SYSTICK);
errors:
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_write_data(USB_HS_DEVICE_endpoint_t* endpoint, uint8_t* data_in, uint32_t data_in_size) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    uint8_t ep_phy = 0;
    // Check state.
    if (usb_hs_device_ctx.flags.init == 0) {
        status = USB_HS_DEVICE_ERROR_UNINITIALIZED;
        goto errors;
    }
    // Check endpoint.
    status = _USB_HS_DEVICE_check_endpoint(endpoint);
    if (status != USB_HS_DEVICE_SUCCESS) goto errors;
    // Check parameters.
    if ((data_in == NULL) || (data_in_size == 0)) {
        status = USB_HS_DEVICE_ERROR_NULL_PARAMETER;
    }
    // Check if previous transfer has been completed.
    if (usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_count_bytes < usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_size_bytes) {
        status = USB_HS_DEVICE_ERROR_ENDPOINT_BUSY;
        goto errors;
    }
    // Compute endpoint physical index.
    ep_phy = USB_HS_DEVICE_EP_PHY((endpoint->number), (endpoint->direction));
    // Manage DMA transfer.
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_data = data_in;
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_size_bytes = data_in_size;
    usb_hs_device_ctx.physical_endpoints[ep_phy].dma_transfer_count_bytes = 0;
    // Start transfer.
    _USB_HS_DEVICE_write(ep_phy, (endpoint->number), USB_HS_DEVICE_EP_DIR(ep_phy));
errors:
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_read_data(USB_HS_DEVICE_endpoint_t* endpoint, uint8_t** data_out, uint32_t* data_out_size) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    uint8_t ep_phy = USB_HS_DEVICE_EP_PHY((endpoint->number), (endpoint->direction));
    uint32_t ep_ram_data_address = USB_HS_DEVICE_RAM_DATA_ADDRESS(usb_hs_device_ctx.physical_endpoints[ep_phy].address_offset[_USB_HS_DEVICE_get_endpoint_buffer(ep_phy, USB_HS_DEVICE_ENDPOINT_BUFFER_STATE_FREE)]);
    // Check state.
    if (usb_hs_device_ctx.flags.init == 0) {
        status = USB_HS_DEVICE_ERROR_UNINITIALIZED;
        goto errors;
    }
    // Check endpoint.
    status = _USB_HS_DEVICE_check_endpoint(endpoint);
    if (status != USB_HS_DEVICE_SUCCESS) goto errors;
    // Check parameter.
    if ((data_out == NULL) || (data_out_size == NULL)) {
        status = USB_HS_DEVICE_ERROR_NULL_PARAMETER;
        goto errors;
    }
    // Update output data.
    (*data_out) = (uint8_t*) &(usb_hs_device_ram_data.data[ep_ram_data_address]);
    // Compute data size (RAM has been allocated with the maximum packet size).
    (*data_out_size) = (endpoint->max_packet_size_bytes - usb_hs_device_ctx.physical_endpoints[ep_phy].dma_n_bytes);
errors:
    return status;
}

/*******************************************************************/
USB_HS_DEVICE_status_t USB_HS_DEVICE_read_setup(uint8_t** setup_out, uint32_t* setup_out_size) {
    // Local variables.
    USB_HS_DEVICE_status_t status = USB_HS_DEVICE_SUCCESS;
    uint8_t ep_phy = USB_HS_DEVICE_EP_PHY(0, USB_HS_DEVICE_ENDPOINT_DIRECTION_OUT);
    uint32_t ep_ram_data_address = USB_HS_DEVICE_RAM_DATA_ADDRESS(usb_hs_device_ctx.physical_endpoints[ep_phy].address_offset[USB_HS_DEVICE_ENDPOINT_BUFFER_1]);
    // Check state.
    if (usb_hs_device_ctx.flags.init == 0) {
        status = USB_HS_DEVICE_ERROR_UNINITIALIZED;
        goto errors;
    }
    // Check parameter.
    if ((setup_out == NULL) || (setup_out_size == NULL)) {
        status = USB_HS_DEVICE_ERROR_NULL_PARAMETER;
        goto errors;
    }
    // Update output data.
    (*setup_out) = (uint8_t*) &(usb_hs_device_ram_data.data[ep_ram_data_address]);
    // Compute data size (NBytes field is not updated for setup packets).
    (*setup_out_size) = USB_HS_DEVICE_SETUP_PACKET_SIZE_BYTES;
errors:
    return status;
}

#endif /* LPC55XX_DRIVERS_DISABLE */
